package com.obast.charer.common.plugin.core.thing.charger;

import lombok.AllArgsConstructor;
import lombok.Getter;

import java.util.Objects;

/**
 * 设备停止码
 */
@Getter
@AllArgsConstructor
public enum ChargerStopCode {

    //充电完成
    Finish40("40", "结束充电，APP 远程停止"),
    Finish41("41", "结束充电，SOC 达到 100%"),
    Finish42("42", "结束充电，充电电量满足设定条件"),
    Finish43("43", "结束充电，充电金额满足设定条件"),
    Finish44("44", "结束充电，充电时间满足设定条件"),
    Finish45("45", "结束充电，手动停止充电"),
    Finish46("46", "结束充电，其他方式"),
    Finish47("47", "结束充电，其他方式"),
    Finish48("48", "结束充电，其他方式"),
    Finish49("49", "结束充电，其他方式"),

    //充电启动失败
    Fail4a("4a", "充电启动失败，充电桩控制系统故障(需要重启或自动恢复)"),
    Fail4b("4b", "充电启动失败，控制导引断开"),
    Fail4c("4c", "充电启动失败，断路器跳位"),
    Fail4d("4d", "充电启动失败，电表通信中断"),
    Fail4e("4e", "充电启动失败，余额不足"),
    Fail4f("4f", "充电启动失败，充电模块故障"),
    Fail50("50", "充电启动失败，急停开入"),
    Fail51("52", "充电启动失败，防雷器异常"),
    Fail52("52", "充电启动失败，BMS 未就绪"),
    Fail53("53", "充电启动失败，温度异常"),
    Fail54("54", "充电启动失败，电池反接故障"),
    Fail55("55", "充电启动失败，电子锁异常"),
    Fail56("56", "充电启动失败，合闸失败"),
    Fail57("57", "充电启动失败，绝缘异常"),
    Fail58("58", "预留"),
    Fail59("59", "充电启动失败，接收 BMS 握手报文 BHM 超时"),
    Fail5a("5a", "充电启动失败，接收 BMS 和车辆的辨识报文超时 BRM"),
    Fail5b("5b", "充电启动失败，接收电池充电参数报文超时 BCP"),
    Fail5c("5c", "充电启动失败，接收 BMS 完成充电准备报文超时 BRO AA"),
    Fail5d("5d", "充电启动失败，接收电池充电总状态报文超时 BCS"),
    Fail5e("5e", "充电启动失败，接收电池充电要求报文超时 BCL"),
    Fail5f("5f", "充电启动失败，接收电池状态信息报文超时 BSM"),
    Fail60("60", "充电启动失败，GB2015 电池在 BHM 阶段有电压不允许充电"),
    Fail61("61", "充电启动失败，GB2015 辨识阶段在 BRO_AA 时候电池实际电压 与 BCP 报文电池电压差距大于 5%"),
    Fail62("62", "充电启动失败，B2015 充电机在预充电阶段从 BRO_AA 变成 BRO_00 状态"),
    Fail63("63", "充电启动失败，接收主机配置报文超时"),
    Fail64("64", "充电启动失败，充电机未准备就绪,我们没有回 CRO AA，对应 老国标"),
    Fail65("65", "其他原因"),
    Fail66("66", "其他原因"),
    Fail67("67", "其他原因"),
    Fail68("68", "其他原因"),
    Fail69("69", "其他原因"),

    //充电异常中止
    Stop6a("6a", "充电异常中止，系统闭锁"),
    Stop6b("6b", "充电异常中止，导引断开"),
    Stop6c("6c", "充电异常中止，断路器跳位"),
    Stop6d("6d", "充电异常中止，电表通信中断"),
    Stop6e("6e", "充电异常中止，余额不足"),
    Stop6f("6f", "充电异常中止，交流保护动作"),
    Stop70("70", "充电异常中止，直流保护动作"),
    Stop71("71", "充电异常中止，充电模块故障"),
    Stop72("72", "充电异常中止，急停开入"),
    Stop73("73", "充电异常中止，防雷器异常"),
    Stop74("74", "充电异常中止，温度异常"),
    Stop75("75", "充电异常中止，输出异常"),
    Stop76("76", "充电异常中止，充电无流"),
    Stop77("77", "充电异常中止，电子锁异常"),
    Stop78("78", "预留"),
    Stop79("79", "充电异常中止，总充电电压异常"),
    Stop7a("7a", "充电异常中止，总充电电流异常"),
    Stop7b("7b", "充电异常中止，单体充电电压异常"),
    Stop7c("7c", "充电异常中止，电池组过温"),
    Stop7d("7d", "充电异常中止，最高单体充电电压异常"),
    Stop7e("7e", "充电异常中止，最高电池组过温"),
    Stop7f("7f", "充电异常中止，BMV单体充电电压异常"),
    Stop80("80", "充电异常中止，BMT电池组过温"),
    Stop81("81", "充电异常中止，电池状态异常停止充电"),
    Stop82("82", "充电异常中止，车辆发报文禁止充电"),
    Stop83("83", "充电异常中止，充电桩断电"),
    Stop84("84", "充电异常中止，接收电池充电总状态报文超时"),
    Stop85("85", "充电异常中止，接收电池充电要求报文超时"),
    Stop86("86", "充电异常中止，接收电池状态信息报文超时"),
    Stop87("87", "充电异常中止，接收BMS中止充电报文超时"),
    Stop88("88", "充电异常中止，接收BMS充电统计报文超时"),
    Stop89("89", "充电异常中止，接收对侧CCS报文超时"),
    Stop8a("8a", "其他原因"),
    Stop8b("8b", "其他原因"),
    Stop8c("8c", "其他原因"),
    Stop8d("8d", "其他原因"),
    Stop8e("8e", "其他原因"),
    Stop8f("8f", "其他原因"),
    Stop90("90", "其他原因"),
;

    private final String code;

    private final String message;

    public static ChargerStopCode fromCode(String code) {
        for (ChargerStopCode stopCode : ChargerStopCode.values()) {
            if (Objects.equals(stopCode.getCode(), code)) {
                return stopCode;
            }
        }
        return null;
    }

}


